#+title: Homework 3:  Machine Learning for Language Understanding
#+author: Toni Kazic
#+date: Fall, 2023

# <2021-11-16 Tue>


#+SETUPFILE: "../../../common/preamble.org"
#+LATEX_CLASS: article
#+OPTIONS: toc:nil
#+OPTIONS: ^:nil

#+LATEX_HEADER: \usepackage{langsci-avm}
# http://ftp.math.purdue.edu/mirrors/ctan.org/macros/latex/contrib/langsci-avm/langsci-avm.pdf

#+LATEX_HEADER: \newcommand{\grmr}[2]{\ensuremath{\mathrm{#1} & \,\longrightarrow\, \mathrm{#2}}}
#+LATEX_HEADER: \newcommand{\txtgrmr}[2]{\ensuremath{\mathrm{#1} \,\longrightarrow\, \mathrm{#2}}}
#+LATEX_HEADER: \newcommand{\grmrhs}[1]{\ensuremath{& \,\longrightarrow\, \mathrm{#1} }}
#+LATEX_HEADER: \newcommand{\wa}[1]{\type{\textnormal{\w{#1}}}}

# compile with pdflatex
#
# Kazic, 3.11.2020



* DONE Introduction

This homework explores the course objective of understanding and
generating machine learning approaches, taking us into (shallow) machine
learning for language understanding. This will give us a chance to consider
the problem of usefully embedding language in numerically defined spaces,
giving us a chance to compare a seat-of-the-pants approach to the more
sophisticated ones we discussed in class.  It also gives us an opportunity
to compare different classifiers for different corpora and get an idea of
how well they perform.


NLTK has some classifiers, but [[http://scikit-learn.org/stable/user_guide.html][scikit-learn]] has more (so be sure to install
any needed modules!).  Let's jump off the deep end together and see how
far we can get.



# We'll revisit the feature extraction problem in the future, so
# this homework explores how well guessed features perform.

# At the end we look briefly at checking coherence using bags of
# words (see [[http://www.nltk.org/book/ch06.html][Section 2.3 ff]] for a short discussion and examples).  This is
# one technique for recognizing textual entailment.




* DONE Who's Who and Solution Patterns
<<whoswho>>



** Group Members

| first name last name | color                         |
|----------------------+-------------------------------|
| Eric                 | green \color{green}\rule{5mm}{3mm} |
| Polycarp             | yellow \color{yellow}\rule{5mm}{3mm} |
| Santhosh             | purple \color{violet}\rule{5mm}{3mm} |



** *Special Instructions for this Homework!*

All group members are to work on problem 6 together.  I want you to have
enough scope to play around with the embeddings and clustering algorithms.



** Two Member Solution Patterns

| color                         | draft solution | revise solution |
|-------------------------------+----------------+-----------------|
| green \color{green}\rule{5mm}{3mm} | odds           | evens           |
| yellow \color{yellow}\rule{5mm}{3mm} | evens          | odds            |


** Three Member Solution Patterns

$i$ is the question number.

#+begin_center
#+ATTR_LaTeX: :mode inline-math :environment array
| \text{color}                  | \text{draft solution} | \text{revise solution} |
|-------------------------------+----------------+-----------------|
| green \color{green}\rule{5mm}{3mm} | i \mod 3 = 1   | i \mod 3 = 0    |
| yellow \color{yellow}\rule{5mm}{3mm} | i \mod 3 = 2   | i \mod 3 = 1    |
| purple \color{violet}\rule{5mm}{3mm} | i \mod 3 = 0   | i \mod 3 = 2    |
#+end_center


* DONE General Instructions
  + /Fill out the group members table and follow the solution patterns/ in
     Section [[whoswho]].

   + /If the question is unclear, tell me your interpretation of it as part
     of your answer./  Feel free to ask about the questions in class or on
     the Slack channel (use =@channel= as others will probably be puzzled
     too). 

   + /For questions using corpora, use the corpus of the lead person./

   + /Put your draft answers right after each question using a *complete,
     functional* =org= mode code or example block./ Make sure your code
     block is complete and functional by testing it in your copy of this
     homework file.

   + /Each group member reviews the others' draft solutions and you revise them together/.

   + /Discuss each other's draft and reviews, finalizing the answers./

   + /Show all your work: code, results, and analysis./  Does your code
     work in this file and produce *exactly* the results you show? 

   + /Post the completed file to Canvas no later than noon on the Tuesday
     indicated/ in the [[../syllabus.org::schedule][schedule in the syllabus]], naming your file with each
     person's first name (no spaces in the file name, and don't forget the
     =.org= extension!).  Only one person should submit the final file.


* DONE Hints

** use scikit-learn/sklearn for the ML parts rather than NLTK
  

** joblib.dump() and joblib.load()

Note that for big data, the [[http://scikit-learn.org/stable/tutorial/basic/tutorial.html][scikit-learn tutorial]] suggests using
joblib.dump() and joblib.load().  However this only writes to disk, not a
string, but can store models and classifiers.


** I expect you to bring questions and struggles with problems 4 and 5 to class!


** You may need to reformat the data generated by NLTK for the [[http://scikit-learn.org/stable/modules/feature_extraction.html][scikit-learn code]].


** You may need to cope with [[http://scikit-learn.org/stable/auto_examples/text/document_classification_20newsgroups.html#sphx-glr-auto-examples-text-document-classification-20newsgroups-py][sparse data]] in scikit-learn.

One reason to use the universal tagset is that it doesn't have very many
tags, but depending on your corpus, your suffixes may have more than is
really desirable for problem 4.




* DONE Questions

# specify POS tags in f23!  I mean these throughout

1. [@1] <<tagging>> Randomly select 1000 POS-tagged words from your assigned
   category/corpus and form your training and testing sets so that you
   train on 90% of the words and test on 10%.  Save these somehow so you
   can re-use them in the [[fea-set][next]] problem. Use the universal POS tagset. *If your
   corpus isn't tagged, choose a tagged corpus.* Using a tagger to tag it
   won't help much as it doesn't make a gold standard (that requires
   hand-checking by expert grammarians).
#+begin_src python :results output
#+begin_src python :results output
import nltk
import random
from nltk.corpus import brown

words = brown.tagged_words(categories='fiction', tagset='universal')
# Random seed so we always get the same output from the random sample
random.seed(a=7740)
data_set = random.sample(list(words), 1000)
print(data_set)
random.shuffle(data_set)
train = data_set[:900]
test = data_set[900:]
print(f"Training set: {len(train)} | {train}")
print(f"Testing set: {len(test)} | {test}")
#+end_src

#+results:
: [('house', 'NOUN'), ('bet', 'VERB'), ('the', 'DET'), ('hotels', 'NOUN'), ('and', 'CONJ'), ('broke', 'VERB'), ('about', 'ADV'), ('a', 'DET'), ('phrase', 'NOUN'), ('no', 'DET'), ('just', 'ADV'), ('of', 'ADP'), ('in', 'ADP'), ('the', 'DET'), ('to', 'PRT'), ('questions', 'NOUN'), ('The', 'DET'), ('No', 'ADV'), ('it', 'PRON'), ('.', '.'), ('``', '.'), ('of', 'ADP'), ('door', 'NOUN'), ('toward', 'ADP'), ('the', 'DET'), ('ice-chest', 'NOUN'), ('worry', 'VERB'), (',', '.'), ('.', '.'), ('happen', 'VERB'), ('.', '.'), ('childhood', 'NOUN'), ('to', 'PRT'), ('so', 'ADV'), ('If', 'ADP'), ('New', 'ADJ'), ('more', 'ADV'), ('south', 'NOUN'), ('gouged', 'VERB'), ("ain't", 'VERB'), ('panic', 'NOUN'), (';', '.'), ('of', 'ADP'), ('.', '.'), ('in', 'ADP'), ('look', 'NOUN'), ('this', 'DET'), ('better', 'ADV'), ('nothing', 'NOUN'), ('I', 'PRON'), ('center', 'NOUN'), ('with', 'ADP'), ('.', '.'), ('waiting', 'VERB'), ('.', '.'), ('bed', 'NOUN'), ('young', 'ADJ'), (':', '.'), ('all', 'PRT'), ('That', 'DET'), ('and', 'CONJ'), ('fatigue', 'NOUN'), ('will', 'VERB'), ('taken', 'VERB'), ('a', 'DET'), ('unbroken', 'ADJ'), ('drawings', 'NOUN'), ('I', 'PRON'), ('was', 'VERB'), ('a', 'DET'), ('.', '.'), ('was', 'VERB'), ('at', 'ADP'), (',', '.'), ('Anthony', 'NOUN'), ('``', '.'), ('had', 'VERB'), ('that', 'ADP'), ('under', 'ADP'), ('he', 'PRON'), ('While', 'ADP'), ('certainly', 'ADV'), ('house', 'NOUN'), ('ran', 'VERB'), ('too', 'ADV'), ('when', 'ADV'), ('``', '.'), ('Catholics', 'NOUN'), ('him', 'PRON'), ('preaching', 'VERB'), ('for', 'ADP'), ('mining', 'VERB'), ('ring', 'NOUN'), ('over', 'ADP'), ('the', 'DET'), ('kind', 'NOUN'), ('.', '.'), ('``', '.'), ('He', 'PRON'), ('ground', 'NOUN'), ('to', 'PRT'), ('this', 'DET'), ('.', '.'), ('The', 'DET'), ("''", '.'), ('cover', 'NOUN'), ('patronne', 'X'), ('flick', 'NOUN'), ('that', 'DET'), ('Connections', 'NOUN'), ('were', 'VERB'), ('needles', 'NOUN'), ('the', 'DET'), ('say', 'VERB'), ('.', '.'), ('ready', 'ADJ'), ('myself', 'PRON'), ('but', 'CONJ'), ('it', 'PRON'), ('I', 'PRON'), ('.', '.'), ('just', 'ADV'), ('about', 'ADP'), ('sketching', 'VERB'), ('and', 'CONJ'), ('yellowing', 'VERB'), ('she', 'PRON'), ('Five', 'NUM'), ('the', 'DET'), ('the', 'DET'), ("o'clock", 'ADV'), ('.', '.'), ('it', 'PRON'), (',', '.'), ('ducks', 'NOUN'), ('into', 'ADP'), ('necessary', 'ADJ'), ('whereas', 'ADP'), ('time', 'NOUN'), ('presence', 'NOUN'), ('desires', 'NOUN'), (',', '.'), ('years', 'NOUN'), ('reply', 'NOUN'), ('autumn', 'NOUN'), ('down', 'PRT'), ('read', 'VERB'), ('what', 'DET'), ('.', '.'), ('dumped', 'VERB'), ('things', 'NOUN'), ('cleaned', 'VERB'), ('expected', 'VERB'), ('him', 'PRON'), ('before', 'ADP'), ('my', 'DET'), ('.', '.'), ('in', 'ADP'), ('sold', 'VERB'), ('Argiento', 'NOUN'), ('rent', 'NOUN'), ('.', '.'), ('on', 'ADP'), ('head', 'NOUN'), ('meaning', 'NOUN'), ('conduct', 'NOUN'), ('was', 'VERB'), ('had', 'VERB'), ('.', '.'), ('while', 'ADP'), ('.', '.'), ('is', 'VERB'), ('seeming', 'VERB'), ('in', 'ADP'), ('in', 'ADP'), ('a', 'DET'), ('girl', 'NOUN'), ("Jack's", 'NOUN'), ('Miss', 'NOUN'), ('He', 'PRON'), ('Warsaw', 'NOUN'), ('are', 'VERB'), ('lights', 'NOUN'), ('to', 'PRT'), ("one's", 'NOUN'), ('abed', 'ADV'), ("''", '.'), ('her', 'DET'), ('.', '.'), ('seemed', 'VERB'), ('start', 'VERB'), ('among', 'ADP'), ('skin', 'NOUN'), ('could', 'VERB'), ('be', 'VERB'), ('thick', 'ADJ'), ('plates', 'NOUN'), ('fine-looking', 'ADJ'), (',', '.'), ('in', 'ADP'), ('early', 'ADV'), ('a', 'DET'), ('.', '.'), ('been', 'VERB'), ('would', 'VERB'), ("''", '.'), (',', '.'), ('.', '.'), ('do', 'VERB'), ('Here', 'ADV'), ('and', 'CONJ'), ('hurry', 'NOUN'), ('thought', 'VERB'), ('a', 'DET'), ('she', 'PRON'), ('wedding', 'NOUN'), ('make', 'VERB'), ('neglected', 'VERB'), ('whiskey', 'NOUN'), ('one', 'NUM'), ('a', 'DET'), ('She', 'PRON'), ('what', 'DET'), ('he', 'PRON'), ('however', 'ADV'), (',', '.'), ('it', 'PRON'), ('far', 'ADV'), ('smile', 'NOUN'), ('a', 'DET'), ('the', 'DET'), ('calumny', 'NOUN'), ('the', 'DET'), ('.', '.'), ('marble', 'NOUN'), ('Bowman', 'NOUN'), ('into', 'ADP'), ('clothes', 'NOUN'), ('the', 'DET'), (',', '.'), ('chose', 'VERB'), ('floor', 'NOUN'), ('how', 'ADV'), ('hand', 'NOUN'), ('He', 'PRON'), ('make', 'VERB'), ('While', 'ADP'), ('you', 'PRON'), ('of', 'ADP'), ('and', 'CONJ'), ('``', '.'), ('of', 'ADP'), ('Oh', 'PRT'), ('married', 'VERB'), ('Council', 'NOUN'), ('borrowed', 'VERB'), ('as', 'ADP'), ('like', 'ADP'), ('What', 'DET'), ('what', 'DET'), (',', '.'), ('become', 'VERB'), ('seem', 'VERB'), ('.', '.'), ('identity', 'NOUN'), (',', '.'), ('in', 'ADP'), ('went', 'VERB'), (',', '.'), ('Your', 'DET'), ('and', 'CONJ'), ("''", '.'), ('complete', 'ADJ'), ('if', 'ADP'), (',', '.'), ('three', 'NUM'), ('she', 'PRON'), ('Rector', 'NOUN'), ('knowing', 'VERB'), ('to', 'PRT'), ('cabins', 'NOUN'), ('maybe', 'ADV'), ('milk', 'NOUN'), ('no', 'DET'), ('bedroom', 'NOUN'), ('the', 'DET'), ('postmark', 'NOUN'), ('waded', 'VERB'), ('one', 'NUM'), ('.', '.'), ('here', 'ADV'), ('pitcher', 'NOUN'), ('his', 'DET'), ('grunt', 'VERB'), ('.', '.'), ('shook', 'VERB'), ('Seventh', 'ADJ'), ('even', 'ADV'), ('grounds', 'NOUN'), ("''", '.'), ('beset', 'VERB'), ('in', 'ADP'), (',', '.'), ('smoked', 'VERB'), ('it', 'PRON'), (',', '.'), ('afterward', 'ADV'), ('progress', 'NOUN'), ('being', 'VERB'), ('and', 'CONJ'), ('a', 'DET'), ('saw', 'VERB'), ("''", '.'), ('and', 'CONJ'), ('nuns', 'NOUN'), ('church', 'NOUN'), ('above', 'ADV'), ('took', 'VERB'), ('the', 'DET'), ('.', '.'), ('.', '.'), ('climbed', 'VERB'), ('not', 'ADV'), ('in', 'ADP'), ('her', 'PRON'), ('a', 'DET'), ('the', 'DET'), ('top', 'NOUN'), ('Thelma', 'NOUN'), ('worked', 'VERB'), ('placed', 'VERB'), ('to', 'ADP'), ('and', 'CONJ'), ('Lying', 'VERB'), ('his', 'DET'), ('fork', 'NOUN'), ('willya', 'VERB'), ('amount', 'NOUN'), ('himself', 'PRON'), (',', '.'), ('Papa', 'NOUN'), ('of', 'ADP'), ("one's", 'NOUN'), ('sick', 'ADJ'), ('into', 'ADP'), ('remained', 'VERB'), (',', '.'), ('Kate', 'NOUN'), ('deserving', 'ADJ'), ('beans', 'NOUN'), ('his', 'DET'), ('hand', 'NOUN'), ('the', 'DET'), ('a', 'DET'), ('He', 'PRON'), ('slapped', 'VERB'), ('whisky', 'NOUN'), ('the', 'DET'), (',', '.'), ('was', 'VERB'), ('poncho', 'NOUN'), ('said', 'VERB'), ('well', 'ADV'), ('wrist', 'NOUN'), ('that', 'ADP'), ('reach', 'VERB'), ('final', 'ADJ'), ('and', 'CONJ'), ('squad', 'NOUN'), ('conditions', 'NOUN'), ('ground', 'NOUN'), ('dope-ridden', 'ADJ'), ('for', 'ADP'), ('flew', 'VERB'), (',', '.'), ('I', 'PRON'), ('?', '.'), ('if', 'ADP'), ('bosom', 'NOUN'), ('Negro', 'NOUN'), ('there', 'PRT'), ('.', '.'), ('the', 'DET'), (',', '.'), ('.', '.'), (',', '.'), ('but', 'CONJ'), ('and', 'CONJ'), ('her', 'PRON'), ('winds', 'NOUN'), (',', '.'), ('of', 'ADP'), ('.', '.'), ('Harpers', 'NOUN'), ('no', 'DET'), ('had', 'VERB'), ('on', 'ADP'), ("They'll", 'PRT'), ('nose', 'NOUN'), ('went', 'VERB'), ('the', 'DET'), ('and', 'CONJ'), (',', '.'), ('the', 'DET'), ('behind', 'ADP'), ('town', 'NOUN'), ('and', 'CONJ'), ('of', 'ADP'), ('have', 'VERB'), ('asleep', 'ADV'), (',', '.'), ('of', 'ADP'), ('when', 'ADV'), ('of', 'ADP'), ('that', 'PRON'), ('and', 'CONJ'), ('deep-set', 'ADJ'), ('him', 'PRON'), ('?', '.'), ('.', '.'), ('it', 'PRON'), (',', '.'), ('to', 'PRT'), ('fishers', 'NOUN'), ('The', 'DET'), ('never', 'ADV'), ('of', 'ADP'), ('found', 'VERB'), ('were', 'VERB'), ('out', 'PRT'), ('the', 'DET'), ('know', 'VERB'), ('we', 'PRON'), ('coat', 'NOUN'), ("''", '.'), ('room', 'NOUN'), ('``', '.'), ('to', 'PRT'), ('seen', 'VERB'), ('she', 'PRON'), ('.', '.'), ('.', '.'), ('for', 'ADP'), ('towels', 'NOUN'), ('no', 'DET'), ('order', 'NOUN'), ('chambermaid', 'NOUN'), ('the', 'DET'), ('find', 'VERB'), ('transfer', 'NOUN'), ('let', 'VERB'), ('slums', 'NOUN'), (',', '.'), ('Take', 'VERB'), ('a', 'DET'), ('the', 'DET'), ('natural', 'ADJ'), ('or', 'CONJ'), (',', '.'), ('brought', 'VERB'), ('recognized', 'VERB'), ('He', 'PRON'), ('found', 'VERB'), ('big', 'ADJ'), ('went', 'VERB'), ('said', 'VERB'), ('wife', 'NOUN'), ('can', 'VERB'), ('desire', 'NOUN'), ('from', 'ADP'), ('those', 'DET'), ('the', 'DET'), ('express', 'NOUN'), ('Byron', 'NOUN'), ('meeting', 'NOUN'), ('himself', 'PRON'), ('else', 'ADV'), ('food', 'NOUN'), ('with', 'ADP'), ('done', 'VERB'), ('in', 'ADP'), ('in', 'ADP'), ('they', 'PRON'), ('sandy', 'ADJ'), ('crisis', 'NOUN'), ('I', 'PRON'), ('the', 'DET'), ('the', 'DET'), ('doctor', 'NOUN'), ('Treasury', 'NOUN'), ('the', 'DET'), ('.', '.'), ('the', 'DET'), ('Good-by', 'PRT'), ('and', 'CONJ'), ('Duclos', 'NOUN'), ('Sundays', 'NOUN'), ('and', 'CONJ'), ('kissing', 'VERB'), ('to', 'PRT'), ('He', 'PRON'), ('would', 'VERB'), (';', '.'), ('bastards', 'NOUN'), ('become', 'VERB'), ('directory', 'NOUN'), ('moonlight', 'NOUN'), ('beyond', 'ADV'), ('mean', 'VERB'), ('had', 'VERB'), ('had', 'VERB'), ('Adam', 'NOUN'), ('upstairs', 'ADV'), ('a', 'DET'), ('test', 'NOUN'), ('people', 'NOUN'), ('bone', 'NOUN'), ('I', 'PRON'), ('it', 'PRON'), ('said', 'VERB'), ('did', 'VERB'), ('would', 'VERB'), ('from', 'ADP'), (',', '.'), ('a', 'DET'), ('``', '.'), (',', '.'), ('I', 'PRON'), ('and', 'CONJ'), ('have', 'VERB'), ('.', '.'), ('bad', 'ADJ'), ('about', 'ADP'), ('playing', 'VERB'), ('provincial', 'ADJ'), ("''", '.'), ('There', 'PRT'), ('way', 'NOUN'), ('Anthony', 'NOUN'), ('man', 'NOUN'), ('of', 'ADP'), ('rest', 'NOUN'), ('!', '.'), ('days', 'NOUN'), ('all', 'PRT'), (',', '.'), ('She', 'PRON'), ('reason', 'NOUN'), ('God', 'NOUN'), ('.', '.'), ('junction', 'NOUN'), ('general', 'ADJ'), ('difficulty', 'NOUN'), ('would', 'VERB'), ('poured', 'VERB'), ('tipped', 'VERB'), ('They', 'PRON'), (',', '.'), ('for', 'ADP'), ('I', 'PRON'), ('box', 'NOUN'), ('those', 'DET'), ("I've", 'PRT'), ('.', '.'), ('had', 'VERB'), ('glow', 'NOUN'), ('scent', 'NOUN'), ('Army', 'NOUN'), ('on', 'ADP'), ('marched', 'VERB'), ('had', 'VERB'), ('very', 'ADV'), ('or', 'CONJ'), ('?', '.'), ('he', 'PRON'), ('in', 'ADP'), ('deacon', 'NOUN'), ('at', 'ADP'), ('.', '.'), ('seems', 'VERB'), ('.', '.'), ('bright', 'ADJ'), ('a', 'DET'), ('beard', 'NOUN'), ('them', 'PRON'), ('like', 'ADP'), ('the', 'DET'), ('.', '.'), ('your', 'DET'), ('it', 'PRON'), ('drizzle', 'NOUN'), ('fact', 'NOUN'), ('Scout', 'NOUN'), ('of', 'ADP'), ('never', 'ADV'), ('for', 'ADP'), (',', '.'), (',', '.'), ('beer', 'NOUN'), ('``', '.'), ('her', 'DET'), ('a', 'DET'), ('on', 'ADP'), ('besides', 'ADV'), ('futility', 'NOUN'), ('suddenly', 'ADV'), ('of', 'ADP'), ('Methodist', 'ADJ'), ('needled', 'VERB'), ('about', 'ADP'), (',', '.'), ('barley', 'NOUN'), ('heroes', 'NOUN'), ('his', 'DET'), ("''", '.'), ('serve', 'VERB'), ("''", '.'), ('Christ', 'NOUN'), ('with', 'ADP'), ('When', 'ADV'), ('men', 'NOUN'), ('offered', 'VERB'), ('.', '.'), ('be', 'VERB'), ('a', 'DET'), ('Bathyran', 'ADJ'), ('them', 'PRON'), ('hot', 'ADJ'), ('several', 'ADJ'), ('.', '.'), ('These', 'DET'), ('chambre', 'X'), ('of', 'ADP'), ('the', 'DET'), ('cathedrals', 'NOUN'), ('heavily', 'ADV'), ('insides', 'NOUN'), ('over', 'ADP'), ('ran', 'VERB'), ('troubled', 'VERB'), ('but', 'CONJ'), ('single', 'ADJ'), ('in', 'ADP'), ('go', 'VERB'), ('back', 'ADV'), ('or', 'CONJ'), ('hundred', 'NUM'), ('Then', 'ADV'), ('And', 'CONJ'), ('keeping', 'VERB'), ('an', 'DET'), ('not', 'ADV'), ('ones', 'NOUN'), ('eyes', 'NOUN'), ('was', 'VERB'), ('anyway', 'ADV'), ('up', 'ADP'), ('He', 'PRON'), ('hearing', 'VERB'), ('superior', 'ADJ'), ('expression', 'NOUN'), ('think', 'VERB'), (':', '.'), ('of', 'ADP'), ('things', 'NOUN'), ('.', '.'), ('was', 'VERB'), ('had', 'VERB'), ('house', 'NOUN'), ('got', 'VERB'), ('in', 'ADP'), ('eighty-three', 'NUM'), ('Do', 'VERB'), ('miss', 'VERB'), ('the', 'DET'), ('as', 'ADP'), ('he', 'PRON'), ('a', 'DET'), ('and', 'CONJ'), ('neither', 'CONJ'), ('about', 'ADP'), ('spitting', 'VERB'), ('night', 'NOUN'), ('and', 'CONJ'), ('sticks', 'NOUN'), ('street', 'NOUN'), ('and', 'CONJ'), ('It', 'PRON'), ('hostelries', 'NOUN'), ('word', 'NOUN'), ('``', '.'), ('given', 'VERB'), ('A', 'DET'), ('breakfast', 'NOUN'), ('dying', 'VERB'), ('and', 'CONJ'), ('rapidly', 'ADV'), ('over', 'ADP'), ('You', 'PRON'), ('would', 'VERB'), ('the', 'DET'), ('thick', 'ADJ'), (',', '.'), ('signal', 'NOUN'), ('triumphant', 'ADJ'), (',', '.'), ('who', 'PRON'), ('cracked', 'VERB'), ('finger', 'NOUN'), ('anything', 'NOUN'), (':', '.'), ('well-stuffed', 'ADJ'), ('was', 'VERB'), (';', '.'), ('compelled', 'VERB'), ('?', '.'), ('the', 'DET'), ('after', 'ADP'), ('.', '.'), ('whether', 'ADP'), ('--', '.'), ('the', 'DET'), ('.', '.'), ('?', '.'), ('the', 'DET'), ('more', 'ADJ'), ('.', '.'), ('are', 'VERB'), ('try', 'VERB'), ('of', 'ADP'), ('it', 'PRON'), ('without', 'ADP'), ('I', 'PRON'), ('``', '.'), ('perhaps', 'ADV'), ('!', '.'), ('wicked', 'ADJ'), ('of', 'ADP'), ('eyebrow', 'NOUN'), ('throbbing', 'NOUN'), ('had', 'VERB'), ('the', 'DET'), ('successful', 'ADJ'), ('to', 'ADP'), ('.', '.'), ('he', 'PRON'), ('audience', 'NOUN'), ('moist', 'ADJ'), ('until', 'ADP'), ('what', 'DET'), (',', '.'), ('to', 'PRT'), ('and', 'CONJ'), ('kill', 'VERB'), ('sip', 'NOUN'), ('and', 'CONJ'), ('bolt', 'NOUN'), (',', '.'), (',', '.'), ('sure', 'VERB'), ('the', 'DET'), ('.', '.'), ('a', 'DET'), ('of', 'ADP'), ('leather', 'NOUN'), ('to', 'ADP'), ('all', 'PRT'), ('of', 'ADP'), ('soft', 'ADJ'), ('air', 'NOUN'), ('house', 'NOUN'), ('the', 'DET'), ('is', 'VERB'), ('mark', 'NOUN'), ('among', 'ADP'), ('they', 'PRON'), ('.', '.'), ('it', 'PRON'), ('?', '.'), ('a', 'DET'), ('breeches', 'NOUN'), ('when', 'ADV'), ('speak', 'VERB'), ('men', 'NOUN'), ('he', 'PRON'), ('boys', 'NOUN'), ('a', 'DET'), ('he', 'PRON'), ('to', 'ADP'), ('knack', 'NOUN'), ('the', 'DET'), ('.', '.'), ('the', 'DET'), ('He', 'PRON'), ('and', 'CONJ'), ('studio', 'NOUN'), ('undo', 'VERB'), ('.', '.'), ('baby', 'NOUN'), ('So', 'ADV'), ('working', 'VERB'), ('as', 'ADP'), ('The', 'DET'), ('a', 'DET'), ('right', 'ADV'), ('have', 'VERB'), ('long', 'ADJ'), ('until', 'ADP'), ('where', 'ADV'), ('now', 'ADV'), ('awkwardly', 'ADV'), ('months', 'NOUN'), ('When', 'ADV'), ('brandy', 'NOUN'), ('be', 'VERB'), ('city', 'NOUN'), (',', '.'), ('the', 'DET'), ('my', 'DET'), ('had', 'VERB'), ('armpits', 'NOUN'), ('told', 'VERB'), ('stairs', 'NOUN'), ('front', 'ADJ'), ('was', 'VERB'), ('was', 'VERB'), ('looked', 'VERB'), ('arm', 'NOUN'), ('medicines', 'NOUN'), ('teaspoonful', 'NOUN'), ('merging', 'VERB'), ('came', 'VERB'), ('?', '.'), ('Before', 'ADP'), ('the', 'DET'), ('kept', 'VERB'), ('populace', 'NOUN'), ('what', 'DET'), ('toward', 'ADP'), ('.', '.'), ('.', '.'), ('Styka', 'NOUN'), ('all', 'PRT'), ('them', 'PRON'), ('screeching', 'VERB'), (',', '.'), ('his', 'DET'), ('a', 'DET'), ('Otherwise', 'ADV'), ('men', 'NOUN'), ('not', 'ADV'), ('mad', 'ADJ'), ('sense', 'NOUN'), ('?', '.'), ('jackdaws', 'NOUN'), ('.', '.'), ('Here', 'ADV'), ('what', 'DET'), ('solid', 'ADJ'), ('dared', 'VERB'), ('in', 'ADP'), ('was', 'VERB'), ('figure', 'NOUN'), ('impossible', 'ADJ'), ('no', 'DET'), ('from', 'ADP'), ('arm', 'NOUN'), ('Art', 'NOUN'), ('The', 'DET'), ('his', 'DET'), ('work', 'NOUN'), ('safety', 'NOUN'), ('little', 'ADJ'), ('.', '.'), ('.', '.'), ('every', 'DET'), ('English-Dutch', 'ADJ'), ('Good', 'ADJ'), ('know', 'VERB'), ('later', 'ADV'), ('amazed', 'VERB'), ('hearing', 'VERB'), ('tolerated', 'VERB'), ('to', 'PRT'), ('Who', 'PRON'), ('those', 'DET'), ('himself', 'PRON'), ('merveilleux', 'X'), ('upstairs', 'ADV'), ('away', 'ADV'), ('Kayabashi', 'NOUN'), ('could', 'VERB'), ('?', '.'), (',', '.'), ('hopped', 'VERB'), ('in', 'ADP'), ('divine', 'ADJ'), ('proud', 'ADJ'), ('sung', 'VERB'), ('grace', 'NOUN'), ('that', 'ADP'), ('made', 'VERB'), ('since', 'ADP'), ('clear', 'ADJ'), ('asked', 'VERB'), ('Not', 'ADV'), ('the', 'DET'), ('.', '.'), ('dust', 'VERB'), ('not', 'ADV'), ("''", '.'), (',', '.'), ('knew', 'VERB'), ('it', 'PRON'), ('to', 'PRT'), ('House', 'NOUN'), ('wait', 'NOUN'), ('find', 'VERB'), ('before', 'ADP'), ('stitches', 'NOUN'), ('The', 'DET'), ('knee-deep', 'ADV'), ('honey', 'NOUN'), (',', '.'), ('were', 'VERB'), ('on', 'ADP'), ('.', '.'), ('scented', 'VERB'), ('jumped', 'VERB'), ('the', 'DET'), ('recorded', 'VERB'), ('watched', 'VERB'), ('We', 'PRON'), ('.', '.'), ('.', '.'), (';', '.'), ('day', 'NOUN'), ('a', 'DET'), ('have', 'VERB'), ('the', 'DET'), ('to', 'PRT'), ('of', 'ADP'), ('``', '.'), ('rain', 'NOUN'), ('he', 'PRON'), ('.', '.'), ('first', 'ADV'), ('intend', 'VERB'), ('to', 'PRT'), ('colonel', 'NOUN'), ('exposed', 'VERB'), ('Billy', 'NOUN'), ('hard', 'ADJ'), ('time', 'NOUN'), ('an', 'DET'), ('in', 'ADP'), ('First', 'ADJ'), ('everyone', 'NOUN'), ('life', 'NOUN'), ('earth', 'NOUN'), ('whatever', 'DET'), ('individual', 'NOUN'), ('.', '.'), ('a', 'DET'), ('Debts', 'NOUN'), ('of', 'ADP'), ('Eileen', 'NOUN'), ('at', 'ADP'), ('the', 'DET'), ('was', 'VERB'), ('brother', 'NOUN'), ('the', 'DET'), ('.', '.'), ('boss', 'NOUN'), ('Alastor', 'NOUN'), ('Jacques', 'NOUN'), ('when', 'ADV'), ('air', 'NOUN'), ('meadows', 'NOUN'), ('the', 'DET'), ('.', '.'), ('Mrs.', 'NOUN'), ('who', 'PRON'), ('altruism', 'NOUN'), ('it', 'PRON'), ('into', 'ADP'), ('.', '.'), ('banker', 'NOUN'), ('the', 'DET'), (',', '.'), ("''", '.'), ('?', '.'), ('is', 'VERB'), (',', '.'), ('out', 'PRT'), ('was', 'VERB'), ('the', 'DET'), ('She', 'PRON'), ('like', 'ADP'), ('labeled', 'VERB')]
: Training set: 900 | [('Otherwise', 'ADV'), ('of', 'ADP'), ('who', 'PRON'), ('himself', 'PRON'), ('provincial', 'ADJ'), ('his', 'DET'), ('the', 'DET'), ('we', 'PRON'), ('for', 'ADP'), ('Papa', 'NOUN'), (',', '.'), ('banker', 'NOUN'), ('under', 'ADP'), ('day', 'NOUN'), ('He', 'PRON'), ('being', 'VERB'), ('was', 'VERB'), ('men', 'NOUN'), ('.', '.'), ('jumped', 'VERB'), ('recognized', 'VERB'), ('If', 'ADP'), ("''", '.'), ('hot', 'ADJ'), ('abed', 'ADV'), ('bastards', 'NOUN'), (';', '.'), ('whether', 'ADP'), ('progress', 'NOUN'), ('besides', 'ADV'), ('meeting', 'NOUN'), ('to', 'PRT'), ('.', '.'), ('I', 'PRON'), ('wedding', 'NOUN'), ('bed', 'NOUN'), ('Debts', 'NOUN'), (',', '.'), ('if', 'ADP'), ('he', 'PRON'), ('look', 'NOUN'), ('God', 'NOUN'), ('of', 'ADP'), ('what', 'DET'), ('mad', 'ADJ'), ('ice-chest', 'NOUN'), ('``', '.'), ('grounds', 'NOUN'), ('breakfast', 'NOUN'), ('When', 'ADV'), ('a', 'DET'), ('would', 'VERB'), ('a', 'DET'), ('a', 'DET'), ('the', 'DET'), ('very', 'ADV'), ('Your', 'DET'), ('would', 'VERB'), ('or', 'CONJ'), ('flew', 'VERB'), ('cover', 'NOUN'), ('now', 'ADV'), ('.', '.'), ('house', 'NOUN'), ('She', 'PRON'), ('young', 'ADJ'), ('in', 'ADP'), ('.', '.'), ('.', '.'), ('waiting', 'VERB'), ('house', 'NOUN'), ('medicines', 'NOUN'), ('the', 'DET'), ('whereas', 'ADP'), ('had', 'VERB'), ('in', 'ADP'), ('among', 'ADP'), ('know', 'VERB'), ('drizzle', 'NOUN'), ('.', '.'), ('marched', 'VERB'), ('the', 'DET'), ('said', 'VERB'), ('Kayabashi', 'NOUN'), ('toward', 'ADP'), ('more', 'ADV'), ('smoked', 'VERB'), ('they', 'PRON'), (',', '.'), ('it', 'PRON'), ('it', 'PRON'), ('seems', 'VERB'), ('Negro', 'NOUN'), (',', '.'), ('is', 'VERB'), ('into', 'ADP'), ('grunt', 'VERB'), ('Not', 'ADV'), ('miss', 'VERB'), ('in', 'ADP'), ('whiskey', 'NOUN'), ('whisky', 'NOUN'), ('.', '.'), ('a', 'DET'), (',', '.'), ('the', 'DET'), ('?', '.'), ('that', 'ADP'), ('in', 'ADP'), ('Here', 'ADV'), ('spitting', 'VERB'), ('Kate', 'NOUN'), ('bosom', 'NOUN'), ('clothes', 'NOUN'), ('girl', 'NOUN'), ('or', 'CONJ'), (',', '.'), ('the', 'DET'), ('kind', 'NOUN'), ('There', 'PRT'), ('.', '.'), ('the', 'DET'), ('.', '.'), ('a', 'DET'), ('boss', 'NOUN'), ('the', 'DET'), ('way', 'NOUN'), ('knack', 'NOUN'), ('tolerated', 'VERB'), ('himself', 'PRON'), ('Duclos', 'NOUN'), ('of', 'ADP'), ('head', 'NOUN'), ('came', 'VERB'), ('And', 'CONJ'), ('worry', 'VERB'), ('asleep', 'ADV'), ('complete', 'ADJ'), ('man', 'NOUN'), ('well', 'ADV'), (';', '.'), ('on', 'ADP'), ('.', '.'), ('dust', 'VERB'), ('milk', 'NOUN'), ('upstairs', 'ADV'), ('childhood', 'NOUN'), ('he', 'PRON'), ('beans', 'NOUN'), ('of', 'ADP'), ('.', '.'), ('could', 'VERB'), ('but', 'CONJ'), ('the', 'DET'), ('screeching', 'VERB'), ('``', '.'), ('``', '.'), ('.', '.'), (',', '.'), ('Warsaw', 'NOUN'), ('behind', 'ADP'), ("''", '.'), ('better', 'ADV'), ('desire', 'NOUN'), ('yellowing', 'VERB'), ('in', 'ADP'), ('hundred', 'NUM'), ('a', 'DET'), ('happen', 'VERB'), ('read', 'VERB'), ('difficulty', 'NOUN'), ('amount', 'NOUN'), ('panic', 'NOUN'), ('sung', 'VERB'), (',', '.'), ('?', '.'), ('on', 'ADP'), ('among', 'ADP'), ('the', 'DET'), ('was', 'VERB'), ('it', 'PRON'), ('honey', 'NOUN'), ('taken', 'VERB'), ('without', 'ADP'), ("''", '.'), ('watched', 'VERB'), ('to', 'PRT'), ('all', 'PRT'), ("''", '.'), ('The', 'DET'), ('for', 'ADP'), ('You', 'PRON'), ("Jack's", 'NOUN'), ('been', 'VERB'), ('working', 'VERB'), ('.', '.'), ('hand', 'NOUN'), ('them', 'PRON'), ('and', 'CONJ'), ('I', 'PRON'), ('hard', 'ADJ'), ('will', 'VERB'), ('amazed', 'VERB'), ('those', 'DET'), ('had', 'VERB'), (',', '.'), ('he', 'PRON'), ('since', 'ADP'), ('Adam', 'NOUN'), ('he', 'PRON'), ('was', 'VERB'), ('They', 'PRON'), (',', '.'), ('out', 'PRT'), ('sketching', 'VERB'), ('not', 'ADV'), ('.', '.'), ('of', 'ADP'), (',', '.'), ('the', 'DET'), (',', '.'), ('found', 'VERB'), ('neither', 'CONJ'), ('to', 'ADP'), ('went', 'VERB'), ('a', 'DET'), ('was', 'VERB'), ('Styka', 'NOUN'), ('word', 'NOUN'), ('about', 'ADP'), ('broke', 'VERB'), ('have', 'VERB'), ('?', '.'), ('chambre', 'X'), ('and', 'CONJ'), ('?', '.'), ('troubled', 'VERB'), ('chambermaid', 'NOUN'), ('would', 'VERB'), ('.', '.'), ('were', 'VERB'), ('was', 'VERB'), ('winds', 'NOUN'), ('ground', 'NOUN'), ('.', '.'), ('was', 'VERB'), ('she', 'PRON'), ('from', 'ADP'), ('and', 'CONJ'), ('of', 'ADP'), ('eyes', 'NOUN'), ('bedroom', 'NOUN'), ('saw', 'VERB'), ('?', '.'), ('ground', 'NOUN'), ('pitcher', 'NOUN'), ('reply', 'NOUN'), ('.', '.'), ('ran', 'VERB'), ('The', 'DET'), ("''", '.'), ('life', 'NOUN'), ('.', '.'), ('.', '.'), ('had', 'VERB'), ('.', '.'), ('make', 'VERB'), ('to', 'PRT'), ('months', 'NOUN'), ('the', 'DET'), ('wife', 'NOUN'), ('desires', 'NOUN'), ('on', 'ADP'), ('.', '.'), ('the', 'DET'), ('Art', 'NOUN'), ('can', 'VERB'), ('but', 'CONJ'), ('preaching', 'VERB'), ('it', 'PRON'), ('chose', 'VERB'), ('here', 'ADV'), ('?', '.'), ('.', '.'), ('the', 'DET'), ('beset', 'VERB'), ('Harpers', 'NOUN'), ('said', 'VERB'), ('reach', 'VERB'), ('hotels', 'NOUN'), ('mining', 'VERB'), ('rapidly', 'ADV'), ('slapped', 'VERB'), ('front', 'ADJ'), ('brother', 'NOUN'), ('a', 'DET'), ('Miss', 'NOUN'), ('one', 'NUM'), ('food', 'NOUN'), ('arm', 'NOUN'), ('air', 'NOUN'), ('he', 'PRON'), ('would', 'VERB'), ('safety', 'NOUN'), ('Mrs.', 'NOUN'), ('Anthony', 'NOUN'), ('scent', 'NOUN'), ("I've", 'PRT'), ('he', 'PRON'), ('little', 'ADJ'), ('at', 'ADP'), ('people', 'NOUN'), ('.', '.'), ('questions', 'NOUN'), ('him', 'PRON'), ('about', 'ADP'), ('and', 'CONJ'), ('dumped', 'VERB'), ('town', 'NOUN'), ('boys', 'NOUN'), ('Bathyran', 'ADJ'), ('eyebrow', 'NOUN'), ('him', 'PRON'), ('.', '.'), ('on', 'ADP'), ('her', 'DET'), ('had', 'VERB'), ('fatigue', 'NOUN'), ('dying', 'VERB'), ('of', 'ADP'), ('and', 'CONJ'), ('labeled', 'VERB'), ("o'clock", 'ADV'), ('climbed', 'VERB'), ('have', 'VERB'), ('three', 'NUM'), ('hurry', 'NOUN'), ('.', '.'), ('superior', 'ADJ'), ("ain't", 'VERB'), ("''", '.'), ('shook', 'VERB'), ('the', 'DET'), ('.', '.'), ('was', 'VERB'), ('in', 'ADP'), ('squad', 'NOUN'), ('would', 'VERB'), ('no', 'DET'), ('bet', 'VERB'), ('Seventh', 'ADJ'), ('no', 'DET'), ('individual', 'NOUN'), ('ring', 'NOUN'), ('Army', 'NOUN'), (',', '.'), ('big', 'ADJ'), ('stitches', 'NOUN'), ('like', 'ADP'), ('willya', 'VERB'), ('test', 'NOUN'), ('wicked', 'ADJ'), ('to', 'ADP'), ('beer', 'NOUN'), ('necessary', 'ADJ'), ('make', 'VERB'), ('and', 'CONJ'), ('thick', 'ADJ'), ('.', '.'), ('divine', 'ADJ'), (',', '.'), ('was', 'VERB'), ('Who', 'PRON'), ('fine-looking', 'ADJ'), ('I', 'PRON'), ('in', 'ADP'), ('postmark', 'NOUN'), ('``', '.'), ('expression', 'NOUN'), ('playing', 'VERB'), ('an', 'DET'), ('else', 'ADV'), ('the', 'DET'), ('done', 'VERB'), ('from', 'ADP'), ('what', 'DET'), ('the', 'DET'), ('so', 'ADV'), ('crisis', 'NOUN'), ('conduct', 'NOUN'), ('.', '.'), ('of', 'ADP'), ('Eileen', 'NOUN'), ('arm', 'NOUN'), ('What', 'DET'), ('to', 'PRT'), ('men', 'NOUN'), ('Thelma', 'NOUN'), ('I', 'PRON'), ('waded', 'VERB'), ('anyway', 'ADV'), ('all', 'PRT'), ('Jacques', 'NOUN'), ('a', 'DET'), ('While', 'ADP'), ('every', 'DET'), ('hand', 'NOUN'), (',', '.'), ('his', 'DET'), ('of', 'ADP'), ('rest', 'NOUN'), ('just', 'ADV'), ('impossible', 'ADJ'), ('knew', 'VERB'), ('insides', 'NOUN'), ('the', 'DET'), ('go', 'VERB'), ('days', 'NOUN'), ('the', 'DET'), ('compelled', 'VERB'), ('top', 'NOUN'), ('studio', 'NOUN'), ('the', 'DET'), ('it', 'PRON'), ('like', 'ADP'), ('the', 'DET'), ('it', 'PRON'), ('earth', 'NOUN'), ('the', 'DET'), ('city', 'NOUN'), ('in', 'ADP'), ('Oh', 'PRT'), ('heavily', 'ADV'), ('no', 'DET'), ('out', 'PRT'), ('a', 'DET'), ('``', '.'), ('and', 'CONJ'), ('audience', 'NOUN'), (':', '.'), ('after', 'ADP'), ('for', 'ADP'), ('or', 'CONJ'), ('a', 'DET'), ('awkwardly', 'ADV'), (',', '.'), ('of', 'ADP'), ('leather', 'NOUN'), ('No', 'ADV'), ('cathedrals', 'NOUN'), ('for', 'ADP'), ('everyone', 'NOUN'), (';', '.'), ('beyond', 'ADV'), ('These', 'DET'), ('--', '.'), ('early', 'ADV'), ('to', 'PRT'), ('think', 'VERB'), ('wrist', 'NOUN'), ('the', 'DET'), ('and', 'CONJ'), ('?', '.'), ('the', 'DET'), ('down', 'PRT'), ('to', 'PRT'), ('soft', 'ADJ'), ('time', 'NOUN'), ('He', 'PRON'), ('seen', 'VERB'), ('center', 'NOUN'), ('before', 'ADP'), ('a', 'DET'), ('kill', 'VERB'), (':', '.'), ('toward', 'ADP'), ('with', 'ADP'), ('grace', 'NOUN'), ('a', 'DET'), ("''", '.'), ('fishers', 'NOUN'), ('teaspoonful', 'NOUN'), ('and', 'CONJ'), ('not', 'ADV'), ('populace', 'NOUN'), ('and', 'CONJ'), ('That', 'DET'), ('doctor', 'NOUN'), ('conditions', 'NOUN'), ('it', 'PRON'), ('seem', 'VERB'), ('anything', 'NOUN'), ('Good-by', 'PRT'), ('on', 'ADP'), ('had', 'VERB'), ('them', 'PRON'), ('successful', 'ADJ'), ('a', 'DET'), ('a', 'DET'), ('what', 'DET'), ('suddenly', 'ADV'), ('myself', 'PRON'), ('in', 'ADP'), ('ducks', 'NOUN'), ('found', 'VERB'), ('Lying', 'VERB'), ('not', 'ADV'), ('slums', 'NOUN'), ('He', 'PRON'), (',', '.'), ('tipped', 'VERB'), ('were', 'VERB'), ('.', '.'), ('a', 'DET'), ('.', '.'), ('jackdaws', 'NOUN'), ('throbbing', 'NOUN'), ('this', 'DET'), ('how', 'ADV'), ('those', 'DET'), ('stairs', 'NOUN'), ('to', 'ADP'), ('before', 'ADP'), ('house', 'NOUN'), ('them', 'PRON'), (',', '.'), ('and', 'CONJ'), ('sick', 'ADJ'), ('for', 'ADP'), ('no', 'DET'), ('cleaned', 'VERB'), ('asked', 'VERB'), ('patronne', 'X'), ('?', '.'), ('of', 'ADP'), ('and', 'CONJ'), ('phrase', 'NOUN'), ('lights', 'NOUN'), ('have', 'VERB'), ('was', 'VERB'), ('The', 'DET'), ('New', 'ADJ'), ('?', '.'), ('about', 'ADP'), ('had', 'VERB'), ('like', 'ADP'), ('as', 'ADP'), ('``', '.'), ('to', 'PRT'), ('``', '.'), ('well-stuffed', 'ADJ'), ('the', 'DET'), ('bone', 'NOUN'), ('Take', 'VERB'), ('.', '.'), ('.', '.'), ('Scout', 'NOUN'), ('your', 'DET'), ('marble', 'NOUN'), ('never', 'ADV'), ('placed', 'VERB'), ('be', 'VERB'), ('got', 'VERB'), ('my', 'DET'), ('thought', 'VERB'), ('armpits', 'NOUN'), (',', '.'), ('and', 'CONJ'), ('seeming', 'VERB'), ('door', 'NOUN'), ('him', 'PRON'), ('thick', 'ADJ'), ('are', 'VERB'), ('cabins', 'NOUN'), ('.', '.'), ('to', 'PRT'), ('merging', 'VERB'), ('.', '.'), ('``', '.'), ('had', 'VERB'), (',', '.'), ('with', 'ADP'), ('street', 'NOUN'), ('order', 'NOUN'), ('meaning', 'NOUN'), ('undo', 'VERB'), ('nothing', 'NOUN'), ('While', 'ADP'), ('he', 'PRON'), ('who', 'PRON'), ('knee-deep', 'ADV'), ('and', 'CONJ'), ('the', 'DET'), ('far', 'ADV'), ('that', 'ADP'), ('and', 'CONJ'), (',', '.'), ('gouged', 'VERB'), ('signal', 'NOUN'), ('and', 'CONJ'), (',', '.'), ('English-Dutch', 'ADJ'), (',', '.'), ('into', 'ADP'), ('heroes', 'NOUN'), ('to', 'ADP'), ('and', 'CONJ'), ('autumn', 'NOUN'), ('perhaps', 'ADV'), ('glow', 'NOUN'), ('first', 'ADV'), ('.', '.'), ('his', 'DET'), (',', '.'), ('junction', 'NOUN'), (',', '.'), ('Catholics', 'NOUN'), ("one's", 'NOUN'), ('.', '.'), (',', '.'), ('knowing', 'VERB'), ('his', 'DET'), ('the', 'DET'), ('try', 'VERB'), ('It', 'PRON'), ('express', 'NOUN'), ('remained', 'VERB'), (',', '.'), ('made', 'VERB'), ('Argiento', 'NOUN'), ('be', 'VERB'), ("They'll", 'PRT'), ('intend', 'VERB'), ('of', 'ADP'), ('went', 'VERB'), ('``', '.'), ('.', '.'), ('Then', 'ADV'), ('.', '.'), (',', '.'), ('not', 'ADV'), ('.', '.'), ('room', 'NOUN'), ('with', 'ADP'), ('at', 'ADP'), ('a', 'DET'), (',', '.'), ('a', 'DET'), (',', '.'), ('Do', 'VERB'), ('had', 'VERB'), ('needles', 'NOUN'), ('become', 'VERB'), ('right', 'ADV'), (',', '.'), ('the', 'DET'), ('towels', 'NOUN'), ("''", '.'), ('brought', 'VERB'), ('exposed', 'VERB'), ("one's", 'NOUN'), ('it', 'PRON'), ('his', 'DET'), ('have', 'VERB'), ('I', 'PRON'), ('they', 'PRON'), ('let', 'VERB'), ('poured', 'VERB'), ('offered', 'VERB'), (',', '.'), ('Billy', 'NOUN'), (',', '.'), ('if', 'ADP'), ('final', 'ADJ'), ('``', '.'), ('into', 'ADP'), ('?', '.'), ('things', 'NOUN'), ('over', 'ADP'), ('The', 'DET'), ('.', '.'), ('house', 'NOUN'), ('it', 'PRON'), ('!', '.'), ('finger', 'NOUN'), ('She', 'PRON'), ('and', 'CONJ'), ('at', 'ADP'), ('those', 'DET'), ('and', 'CONJ'), (',', '.'), ('as', 'ADP'), ('my', 'DET'), (',', '.'), ('.', '.'), ('what', 'DET'), (',', '.'), ('away', 'ADV'), ('Bowman', 'NOUN'), ('He', 'PRON'), ('that', 'ADP'), ('be', 'VERB'), ('in', 'ADP'), ('baby', 'NOUN'), ('the', 'DET'), ('air', 'NOUN'), ('his', 'DET'), ('the', 'DET'), ('altruism', 'NOUN'), ('meadows', 'NOUN'), ('never', 'ADV'), ('deep-set', 'ADJ'), ('a', 'DET'), ('the', 'DET'), ('Council', 'NOUN'), ('a', 'DET'), ('fact', 'NOUN'), ('fork', 'NOUN'), ('She', 'PRON'), ('rain', 'NOUN'), ('there', 'PRT'), ('.', '.'), ('start', 'VERB'), ('.', '.'), ('a', 'DET'), ('deacon', 'NOUN'), ('the', 'DET'), ('Methodist', 'ADJ'), ('.', '.'), ('futility', 'NOUN'), ('into', 'ADP'), ('married', 'VERB'), ('in', 'ADP'), ('drawings', 'NOUN'), ('of', 'ADP'), ('of', 'ADP'), ('maybe', 'ADV'), ('.', '.'), ('know', 'VERB'), ('work', 'NOUN'), ('We', 'PRON'), ('He', 'PRON'), ('had', 'VERB'), ('become', 'VERB'), ('flick', 'NOUN'), ('hopped', 'VERB'), ('scented', 'VERB'), ('above', 'ADV'), ('went', 'VERB'), ('.', '.'), ('and', 'CONJ'), (',', '.'), ('until', 'ADP'), ('the', 'DET'), ('said', 'VERB'), ('the', 'DET'), ('moonlight', 'NOUN'), ('and', 'CONJ'), ('all', 'PRT'), ('ready', 'ADJ'), ('he', 'PRON'), ('you', 'PRON'), ('an', 'DET'), ('breeches', 'NOUN'), ('When', 'ADV'), ('!', '.'), ('bright', 'ADJ'), ('sure', 'VERB'), ('coat', 'NOUN'), ('the', 'DET'), ('all', 'PRT'), ('could', 'VERB'), ('and', 'CONJ'), ('moist', 'ADJ'), ('Here', 'ADV'), ('of', 'ADP'), ('her', 'DET'), ('general', 'ADJ'), ('time', 'NOUN'), (',', '.'), ('sip', 'NOUN'), ('rent', 'NOUN'), ('eighty-three', 'NUM'), ('certainly', 'ADV'), ('Sundays', 'NOUN'), ('later', 'ADV'), ('.', '.'), ('had', 'VERB'), ('too', 'ADV'), ('He', 'PRON'), ('a', 'DET'), ('.', '.'), ('was', 'VERB'), ('Rector', 'NOUN'), ('skin', 'NOUN'), ('back', 'ADV'), ('.', '.'), ('A', 'DET'), ('merveilleux', 'X'), ('her', 'PRON'), ('told', 'VERB'), ('of', 'ADP'), ('the', 'DET'), ('a', 'DET'), ('about', 'ADP'), ('find', 'VERB'), ('.', '.'), ('recorded', 'VERB'), (',', '.'), ('just', 'ADV'), ('long', 'ADJ'), ('directory', 'NOUN'), ('.', '.'), ('a', 'DET'), ('over', 'ADP'), ('in', 'ADP'), ('I', 'PRON'), ('of', 'ADP'), ('to', 'PRT'), ('.', '.'), ('of', 'ADP'), ('.', '.'), ('to', 'PRT'), ('He', 'PRON'), ('of', 'ADP'), ('church', 'NOUN'), ('Treasury', 'NOUN'), ('box', 'NOUN'), ('over', 'ADP'), ('in', 'ADP'), ('proud', 'ADJ'), ('dared', 'VERB'), ('of', 'ADP'), ('.', '.'), ('I', 'PRON'), ('cracked', 'VERB'), ('whatever', 'DET'), ('years', 'NOUN'), ('sandy', 'ADJ'), ('speak', 'VERB'), ('.', '.'), ('neglected', 'VERB'), (',', '.'), ('wait', 'NOUN'), ('.', '.'), ('given', 'VERB'), ('that', 'DET'), ('night', 'NOUN'), ('beard', 'NOUN'), ('upstairs', 'ADV'), ('she', 'PRON'), ('find', 'VERB'), (':', '.'), ('is', 'VERB'), ('kissing', 'VERB'), ('I', 'PRON'), ('took', 'VERB'), ('seemed', 'VERB'), ('.', '.'), ('.', '.'), ('identity', 'NOUN'), ('when', 'ADV'), ('is', 'VERB'), ('say', 'VERB'), ('the', 'DET'), ('.', '.'), (';', '.'), ('the', 'DET'), ('hostelries', 'NOUN'), ('sense', 'NOUN'), ('Alastor', 'NOUN'), ('The', 'DET'), ('.', '.'), ('what', 'DET'), ('when', 'ADV'), ('to', 'PRT'), ('several', 'ADJ'), ('hearing', 'VERB'), (',', '.'), ('dope-ridden', 'ADJ'), ('Byron', 'NOUN'), ('single', 'ADJ'), ('borrowed', 'VERB'), ('that', 'PRON'), ('afterward', 'ADV'), ('The', 'DET'), ('things', 'NOUN'), ('and', 'CONJ'), ('sold', 'VERB'), ('reason', 'NOUN'), ('He', 'PRON'), (',', '.'), ('.', '.'), ('what', 'DET'), ('ones', 'NOUN'), ('the', 'DET'), ('poncho', 'NOUN'), ('the', 'DET'), ('Anthony', 'NOUN'), ('did', 'VERB')]
: Testing set: 100 | [('men', 'NOUN'), ('in', 'ADP'), ('House', 'NOUN'), ('more', 'ADJ'), ("''", '.'), ('Connections', 'NOUN'), ('the', 'DET'), ('the', 'DET'), ('natural', 'ADJ'), ('the', 'DET'), ('needled', 'VERB'), ('nose', 'NOUN'), ('kept', 'VERB'), ('she', 'PRON'), ('up', 'ADP'), ('the', 'DET'), ('when', 'ADV'), ('this', 'DET'), ('clear', 'ADJ'), ('one', 'NUM'), ('calumny', 'NOUN'), ('the', 'DET'), (',', '.'), ('the', 'DET'), ('Before', 'ADP'), ('to', 'PRT'), (',', '.'), ('are', 'VERB'), ('even', 'ADV'), ('south', 'NOUN'), ('it', 'PRON'), ('unbroken', 'ADJ'), ('it', 'PRON'), ('looked', 'VERB'), ('as', 'ADP'), ('figure', 'NOUN'), ('it', 'PRON'), ('plates', 'NOUN'), ('in', 'ADP'), ('nuns', 'NOUN'), ('do', 'VERB'), ('Christ', 'NOUN'), ('of', 'ADP'), ('about', 'ADV'), ('floor', 'NOUN'), ('and', 'CONJ'), ('triumphant', 'ADJ'), ('First', 'ADJ'), ('ran', 'VERB'), ('So', 'ADV'), ('.', '.'), ('in', 'ADP'), ('until', 'ADP'), ('solid', 'ADJ'), ('bolt', 'NOUN'), ('brandy', 'NOUN'), (',', '.'), ('expected', 'VERB'), ("''", '.'), ('she', 'PRON'), ('.', '.'), ('a', 'DET'), ('mark', 'NOUN'), ('worked', 'VERB'), ('were', 'VERB'), ('was', 'VERB'), ('barley', 'NOUN'), ('Good', 'ADJ'), ('keeping', 'VERB'), ('was', 'VERB'), ('while', 'ADP'), ('colonel', 'NOUN'), ('her', 'PRON'), ('from', 'ADP'), ('but', 'CONJ'), ('when', 'ADV'), ('I', 'PRON'), ('the', 'DET'), ('himself', 'PRON'), ("''", '.'), ('transfer', 'NOUN'), ('of', 'ADP'), ('no', 'DET'), ('serve', 'VERB'), ('bad', 'ADJ'), ('Five', 'NUM'), ('smile', 'NOUN'), ('where', 'ADV'), ('sticks', 'NOUN'), ('mean', 'VERB'), ('hearing', 'VERB'), ("''", '.'), ('to', 'PRT'), ('deserving', 'ADJ'), ('.', '.'), ('in', 'ADP'), ('the', 'DET'), ('presence', 'NOUN'), ('``', '.'), ('however', 'ADV')]


2.  [@2] <<fea-set>> For each of tuples in your training set in problem
   [[tagging]], extract the last *three letters for the word* and its entire tag,
   and compile these into an NLTK feature set.  Check to see if the same
   feature is mapped to more than one tag and if so, then retag that
   feature with 'X'.  Again, save the feature set for reuse as a file, at
   minimum as a dictionary.  *Do the same for the test set.*
#+begin_src python :results output
import nltk
import random
from nltk.corpus import brown

words = brown.tagged_words(categories='fiction', tagset='universal')
# Random seed so we always get the same output from the random sample
random.seed(a=7740)
data_set = random.sample(list(words), 1000)
random.shuffle(data_set)
train = data_set[:900]
test = data_set[900:]

def last_three_letters(word):
  if len(word) <= 3:
    return word
  return word[-3:]

def make_feature_set(data):
  fs = {}
  for t in data:
    if last_three_letters(t[0]) in fs:
      fs[last_three_letters(t[0])] = 'X'
    else:
      fs[last_three_letters(t[0])]=t[1]
  return fs

train_fs = make_feature_set(train)
test_fs = make_feature_set(test)
print(f"Training feature set: {train_fs}") 
print(f"Testing feature set: {test_fs}")
#+end_src

#+results:
: Training feature set: {'ise': 'ADV', 'of': 'X', 'who': 'X', 'elf': 'X', 'ial': 'ADJ', 'his': 'X', 'the': 'X', 'we': 'PRON', 'for': 'X', 'apa': 'NOUN', ',': 'X', 'ker': 'NOUN', 'der': 'X', 'day': 'NOUN', 'He': 'X', 'ing': 'X', 'was': 'X', 'men': 'X', '.': 'X', 'ped': 'X', 'zed': 'X', 'If': 'ADP', "''": 'X', 'hot': 'ADJ', 'bed': 'X', 'rds': 'NOUN', ';': 'X', 'her': 'X', 'ess': 'X', 'des': 'X', 'to': 'X', 'I': 'X', 'bts': 'NOUN', 'if': 'X', 'he': 'X', 'ook': 'X', 'God': 'NOUN', 'hat': 'X', 'mad': 'ADJ', 'est': 'X', '``': 'X', 'nds': 'X', 'ast': 'NOUN', 'hen': 'X', 'a': 'X', 'uld': 'X', 'ery': 'X', 'our': 'X', 'or': 'X', 'lew': 'VERB', 'ver': 'X', 'now': 'X', 'use': 'X', 'She': 'X', 'ung': 'X', 'in': 'X', 'nes': 'X', 'eas': 'ADP', 'had': 'X', 'ong': 'X', 'zle': 'NOUN', 'hed': 'X', 'aid': 'X', 'shi': 'NOUN', 'ard': 'X', 'ore': 'X', 'ked': 'X', 'hey': 'X', 'it': 'X', 'ems': 'VERB', 'gro': 'NOUN', 'is': 'X', 'nto': 'X', 'unt': 'X', 'Not': 'ADV', 'iss': 'X', 'key': 'NOUN', 'sky': 'NOUN', '?': 'X', 'ere': 'X', 'ate': 'NOUN', 'som': 'NOUN', 'hes': 'X', 'irl': 'NOUN', 'ind': 'X', 'oss': 'NOUN', 'way': 'X', 'ack': 'X', 'ted': 'X', 'los': 'NOUN', 'ead': 'X', 'ame': 'VERB', 'And': 'CONJ', 'rry': 'X', 'eep': 'X', 'ete': 'ADJ', 'man': 'X', 'ell': 'ADV', 'on': 'X', 'ust': 'X', 'ilk': 'NOUN', 'irs': 'X', 'ood': 'X', 'ans': 'NOUN', 'but': 'X', 'saw': 'X', 'ter': 'X', 'ire': 'NOUN', 'red': 'X', 'pen': 'VERB', 'lty': 'NOUN', 'nic': 'NOUN', 'ney': 'NOUN', 'ken': 'VERB', 'out': 'X', 'all': 'X', 'The': 'X', 'You': 'PRON', "k's": 'NOUN', 'een': 'X', 'and': 'X', 'hem': 'X', 'ill': 'X', 'ose': 'X', 'nce': 'X', 'dam': 'NOUN', 'not': 'X', 'und': 'X', 'ent': 'X', 'yka': 'NOUN', 'ord': 'NOUN', 'oke': 'VERB', 'ave': 'X', 'bre': 'X', 'led': 'X', 'she': 'X', 'rom': 'X', 'yes': 'NOUN', 'oom': 'X', 'ply': 'NOUN', 'ran': 'X', 'ife': 'X', 'ake': 'X', 'ths': 'NOUN', 'res': 'NOUN', 'Art': 'NOUN', 'can': 'VERB', 'set': 'X', 'ers': 'X', 'ach': 'VERB', 'els': 'X', 'dly': 'X', 'ont': 'ADJ', 'one': 'X', 'arm': 'X', 'air': 'X', 'ety': 'NOUN', 'rs.': 'NOUN', 'ony': 'X', "'ve": 'PRT', 'tle': 'ADJ', 'at': 'X', 'ple': 'NOUN', 'ons': 'X', 'him': 'X', 'own': 'X', 'oys': 'NOUN', 'row': 'NOUN', 'gue': 'NOUN', 'ock': 'ADV', 'ree': 'X', 'ior': 'ADJ', "n't": 'VERB', 'uad': 'NOUN', 'no': 'X', 'bet': 'VERB', 'nth': 'ADJ', 'ual': 'NOUN', 'rmy': 'NOUN', 'big': 'ADJ', 'ike': 'X', 'lya': 'VERB', 'eer': 'NOUN', 'ary': 'ADJ', 'ick': 'X', 'ine': 'ADJ', 'Who': 'PRON', 'ark': 'NOUN', 'ion': 'X', 'an': 'X', 'lse': 'ADV', 'so': 'ADV', 'sis': 'NOUN', 'uct': 'NOUN', 'lma': 'NOUN', 'ded': 'X', 'ues': 'NOUN', 'ile': 'X', 'ble': 'X', 'new': 'VERB', 'go': 'VERB', 'ays': 'X', 'top': 'NOUN', 'dio': 'NOUN', 'rth': 'NOUN', 'ity': 'X', 'Oh': 'PRT', 'ily': 'ADV', ':': 'X', 'No': 'ADV', 'als': 'NOUN', 'ond': 'ADV', 'ese': 'DET', '--': '.', 'rly': 'ADV', 'ink': 'VERB', 'ist': 'X', 'oft': 'ADJ', 'ime': 'X', 'ith': 'X', 'ace': 'X', 'ful': 'X', 'tor': 'X', 'eem': 'VERB', '-by': 'PRT', 'nly': 'X', 'cks': 'NOUN', 'ums': 'NOUN', 'aws': 'NOUN', 'how': 'ADV', 'ned': 'X', 'nne': 'X', 'ase': 'NOUN', 'hts': 'NOUN', 'New': 'ADJ', 'as': 'X', 'fed': 'ADJ', 'ced': 'VERB', 'be': 'X', 'got': 'VERB', 'my': 'X', 'ght': 'X', 'its': 'NOUN', 'oor': 'NOUN', 'are': 'VERB', 'ins': 'NOUN', 'eet': 'NOUN', 'ndo': 'VERB', 'far': 'ADV', 'ged': 'VERB', 'nal': 'X', 'tch': 'ADJ', 'oes': 'NOUN', 'umn': 'NOUN', 'aps': 'ADV', 'low': 'NOUN', 'rst': 'ADV', 'ics': 'NOUN', "e's": 'X', 'try': 'VERB', 'It': 'PRON', 'ade': 'VERB', "'ll": 'PRT', 'end': 'VERB', 'Do': 'VERB', 'les': 'NOUN', 'ome': 'X', 'sed': 'VERB', 'let': 'VERB', 'lly': 'NOUN', 'ngs': 'X', '!': 'X', 'ger': 'NOUN', 'aby': 'NOUN', 'ism': 'NOUN', 'ows': 'NOUN', 'cil': 'NOUN', 'act': 'NOUN', 'ork': 'X', 'ain': 'NOUN', 'art': 'VERB', 'con': 'NOUN', 'ied': 'VERB', 'ybe': 'ADV', 'We': 'PRON', 'ove': 'ADV', 'til': 'ADP', 'ady': 'ADJ', 'you': 'PRON', 'ure': 'VERB', 'oat': 'NOUN', 'ral': 'X', 'sip': 'NOUN', 'too': 'ADV', 'kin': 'NOUN', 'A': 'DET', 'eux': 'X', 'old': 'X', 'ory': 'NOUN', 'rch': 'NOUN', 'ury': 'NOUN', 'box': 'NOUN', 'oud': 'ADJ', 'ars': 'NOUN', 'ndy': 'ADJ', 'eak': 'VERB', 'ait': 'NOUN', 'ven': 'VERB', 'med': 'VERB', 'say': 'VERB', 'ies': 'NOUN', 'nse': 'NOUN', 'den': 'ADJ', 'ron': 'NOUN', 'gle': 'ADJ', 'wed': 'VERB', 'son': 'NOUN', 'cho': 'NOUN', 'did': 'VERB'}
: Testing feature set: {'men': 'NOUN', 'in': 'X', 'use': 'NOUN', 'ore': 'X', "''": 'X', 'ons': 'NOUN', 'the': 'X', 'ral': 'ADJ', 'led': 'VERB', 'ose': 'NOUN', 'ept': 'VERB', 'she': 'X', 'up': 'ADP', 'hen': 'X', 'his': 'DET', 'ear': 'ADJ', 'one': 'NUM', 'mny': 'NOUN', ',': 'X', 'to': 'X', 'are': 'VERB', 'ven': 'ADV', 'uth': 'NOUN', 'it': 'X', 'ken': 'ADJ', 'ked': 'X', 'as': 'ADP', 'ure': 'NOUN', 'tes': 'NOUN', 'uns': 'NOUN', 'do': 'VERB', 'ist': 'NOUN', 'of': 'X', 'out': 'ADV', 'oor': 'NOUN', 'and': 'CONJ', 'ant': 'ADJ', 'rst': 'ADJ', 'ran': 'VERB', 'So': 'ADV', '.': 'X', 'til': 'ADP', 'lid': 'ADJ', 'olt': 'NOUN', 'ndy': 'NOUN', 'ted': 'VERB', 'a': 'DET', 'ark': 'NOUN', 'ere': 'X', 'was': 'X', 'ley': 'NOUN', 'ood': 'ADJ', 'ing': 'X', 'ile': 'X', 'nel': 'NOUN', 'her': 'PRON', 'rom': 'ADP', 'but': 'CONJ', 'I': 'PRON', 'elf': 'PRON', 'fer': 'NOUN', 'no': 'DET', 'rve': 'VERB', 'bad': 'ADJ', 'ive': 'NUM', 'cks': 'NOUN', 'ean': 'VERB', 'nce': 'NOUN', '``': '.', 'ver': 'ADV'}

3.  [@3] <<bayesian>> Now train a naive Bayes classifier using the one in
   NLTK or scikit-learn on your saved [[fea-set][feature set]] and show its accuracy.
   Show the ten most informative features (for sure you can get this from
   the NLTK naive Bayes classifier).
#+begin_src python :results output
import nltk
import random
from nltk.corpus import brown

words = brown.tagged_words(categories='fiction', tagset='universal')
# Random seed so we always get the same output from the random sample
random.seed(a=7740)
data_set = random.sample(list(words), 1000)
random.shuffle(data_set)
train = data_set[:900]
test = data_set[900:]

def last_three_letters(word):
  if len(word) <= 3:
    return word
  return word[-3:]

def make_feature_set(data):
  fs = {}
  for t in data:
    if last_three_letters(t[0]) in fs:
      fs[last_three_letters(t[0])] = 'X'
    else:
      fs[last_three_letters(t[0])]=t[1]
  return [(k,v) for k, v in fs.items()]

train_fs = make_feature_set(train)
test_fs = make_feature_set(test)
print(f"Training feature set: {train_fs}") 
print(f"Testing feature set: {test_fs}")
classifier = nltk.NaiveBayesClassifier.train(train_fs)
print(nltk.classify.accuracy(classifier, test_fs))
#+end_src

#+results:
: Training feature set: [('ise', 'ADV'), ('of', 'X'), ('who', 'X'), ('elf', 'X'), ('ial', 'ADJ'), ('his', 'X'), ('the', 'X'), ('we', 'PRON'), ('for', 'X'), ('apa', 'NOUN'), (',', 'X'), ('ker', 'NOUN'), ('der', 'X'), ('day', 'NOUN'), ('He', 'X'), ('ing', 'X'), ('was', 'X'), ('men', 'X'), ('.', 'X'), ('ped', 'X'), ('zed', 'X'), ('If', 'ADP'), ("''", 'X'), ('hot', 'ADJ'), ('bed', 'X'), ('rds', 'NOUN'), (';', 'X'), ('her', 'X'), ('ess', 'X'), ('des', 'X'), ('to', 'X'), ('I', 'X'), ('bts', 'NOUN'), ('if', 'X'), ('he', 'X'), ('ook', 'X'), ('God', 'NOUN'), ('hat', 'X'), ('mad', 'ADJ'), ('est', 'X'), ('``', 'X'), ('nds', 'X'), ('ast', 'NOUN'), ('hen', 'X'), ('a', 'X'), ('uld', 'X'), ('ery', 'X'), ('our', 'X'), ('or', 'X'), ('lew', 'VERB'), ('ver', 'X'), ('now', 'X'), ('use', 'X'), ('She', 'X'), ('ung', 'X'), ('in', 'X'), ('nes', 'X'), ('eas', 'ADP'), ('had', 'X'), ('ong', 'X'), ('zle', 'NOUN'), ('hed', 'X'), ('aid', 'X'), ('shi', 'NOUN'), ('ard', 'X'), ('ore', 'X'), ('ked', 'X'), ('hey', 'X'), ('it', 'X'), ('ems', 'VERB'), ('gro', 'NOUN'), ('is', 'X'), ('nto', 'X'), ('unt', 'X'), ('Not', 'ADV'), ('iss', 'X'), ('key', 'NOUN'), ('sky', 'NOUN'), ('?', 'X'), ('ere', 'X'), ('ate', 'NOUN'), ('som', 'NOUN'), ('hes', 'X'), ('irl', 'NOUN'), ('ind', 'X'), ('oss', 'NOUN'), ('way', 'X'), ('ack', 'X'), ('ted', 'X'), ('los', 'NOUN'), ('ead', 'X'), ('ame', 'VERB'), ('And', 'CONJ'), ('rry', 'X'), ('eep', 'X'), ('ete', 'ADJ'), ('man', 'X'), ('ell', 'ADV'), ('on', 'X'), ('ust', 'X'), ('ilk', 'NOUN'), ('irs', 'X'), ('ood', 'X'), ('ans', 'NOUN'), ('but', 'X'), ('saw', 'X'), ('ter', 'X'), ('ire', 'NOUN'), ('red', 'X'), ('pen', 'VERB'), ('lty', 'NOUN'), ('nic', 'NOUN'), ('ney', 'NOUN'), ('ken', 'VERB'), ('out', 'X'), ('all', 'X'), ('The', 'X'), ('You', 'PRON'), ("k's", 'NOUN'), ('een', 'X'), ('and', 'X'), ('hem', 'X'), ('ill', 'X'), ('ose', 'X'), ('nce', 'X'), ('dam', 'NOUN'), ('not', 'X'), ('und', 'X'), ('ent', 'X'), ('yka', 'NOUN'), ('ord', 'NOUN'), ('oke', 'VERB'), ('ave', 'X'), ('bre', 'X'), ('led', 'X'), ('she', 'X'), ('rom', 'X'), ('yes', 'NOUN'), ('oom', 'X'), ('ply', 'NOUN'), ('ran', 'X'), ('ife', 'X'), ('ake', 'X'), ('ths', 'NOUN'), ('res', 'NOUN'), ('Art', 'NOUN'), ('can', 'VERB'), ('set', 'X'), ('ers', 'X'), ('ach', 'VERB'), ('els', 'X'), ('dly', 'X'), ('ont', 'ADJ'), ('one', 'X'), ('arm', 'X'), ('air', 'X'), ('ety', 'NOUN'), ('rs.', 'NOUN'), ('ony', 'X'), ("'ve", 'PRT'), ('tle', 'ADJ'), ('at', 'X'), ('ple', 'NOUN'), ('ons', 'X'), ('him', 'X'), ('own', 'X'), ('oys', 'NOUN'), ('row', 'NOUN'), ('gue', 'NOUN'), ('ock', 'ADV'), ('ree', 'X'), ('ior', 'ADJ'), ("n't", 'VERB'), ('uad', 'NOUN'), ('no', 'X'), ('bet', 'VERB'), ('nth', 'ADJ'), ('ual', 'NOUN'), ('rmy', 'NOUN'), ('big', 'ADJ'), ('ike', 'X'), ('lya', 'VERB'), ('eer', 'NOUN'), ('ary', 'ADJ'), ('ick', 'X'), ('ine', 'ADJ'), ('Who', 'PRON'), ('ark', 'NOUN'), ('ion', 'X'), ('an', 'X'), ('lse', 'ADV'), ('so', 'ADV'), ('sis', 'NOUN'), ('uct', 'NOUN'), ('lma', 'NOUN'), ('ded', 'X'), ('ues', 'NOUN'), ('ile', 'X'), ('ble', 'X'), ('new', 'VERB'), ('go', 'VERB'), ('ays', 'X'), ('top', 'NOUN'), ('dio', 'NOUN'), ('rth', 'NOUN'), ('ity', 'X'), ('Oh', 'PRT'), ('ily', 'ADV'), (':', 'X'), ('No', 'ADV'), ('als', 'NOUN'), ('ond', 'ADV'), ('ese', 'DET'), ('--', '.'), ('rly', 'ADV'), ('ink', 'VERB'), ('ist', 'X'), ('oft', 'ADJ'), ('ime', 'X'), ('ith', 'X'), ('ace', 'X'), ('ful', 'X'), ('tor', 'X'), ('eem', 'VERB'), ('-by', 'PRT'), ('nly', 'X'), ('cks', 'NOUN'), ('ums', 'NOUN'), ('aws', 'NOUN'), ('how', 'ADV'), ('ned', 'X'), ('nne', 'X'), ('ase', 'NOUN'), ('hts', 'NOUN'), ('New', 'ADJ'), ('as', 'X'), ('fed', 'ADJ'), ('ced', 'VERB'), ('be', 'X'), ('got', 'VERB'), ('my', 'X'), ('ght', 'X'), ('its', 'NOUN'), ('oor', 'NOUN'), ('are', 'VERB'), ('ins', 'NOUN'), ('eet', 'NOUN'), ('ndo', 'VERB'), ('far', 'ADV'), ('ged', 'VERB'), ('nal', 'X'), ('tch', 'ADJ'), ('oes', 'NOUN'), ('umn', 'NOUN'), ('aps', 'ADV'), ('low', 'NOUN'), ('rst', 'ADV'), ('ics', 'NOUN'), ("e's", 'X'), ('try', 'VERB'), ('It', 'PRON'), ('ade', 'VERB'), ("'ll", 'PRT'), ('end', 'VERB'), ('Do', 'VERB'), ('les', 'NOUN'), ('ome', 'X'), ('sed', 'VERB'), ('let', 'VERB'), ('lly', 'NOUN'), ('ngs', 'X'), ('!', 'X'), ('ger', 'NOUN'), ('aby', 'NOUN'), ('ism', 'NOUN'), ('ows', 'NOUN'), ('cil', 'NOUN'), ('act', 'NOUN'), ('ork', 'X'), ('ain', 'NOUN'), ('art', 'VERB'), ('con', 'NOUN'), ('ied', 'VERB'), ('ybe', 'ADV'), ('We', 'PRON'), ('ove', 'ADV'), ('til', 'ADP'), ('ady', 'ADJ'), ('you', 'PRON'), ('ure', 'VERB'), ('oat', 'NOUN'), ('ral', 'X'), ('sip', 'NOUN'), ('too', 'ADV'), ('kin', 'NOUN'), ('A', 'DET'), ('eux', 'X'), ('old', 'X'), ('ory', 'NOUN'), ('rch', 'NOUN'), ('ury', 'NOUN'), ('box', 'NOUN'), ('oud', 'ADJ'), ('ars', 'NOUN'), ('ndy', 'ADJ'), ('eak', 'VERB'), ('ait', 'NOUN'), ('ven', 'VERB'), ('med', 'VERB'), ('say', 'VERB'), ('ies', 'NOUN'), ('nse', 'NOUN'), ('den', 'ADJ'), ('ron', 'NOUN'), ('gle', 'ADJ'), ('wed', 'VERB'), ('son', 'NOUN'), ('cho', 'NOUN'), ('did', 'VERB')]
: Testing feature set: [('men', 'NOUN'), ('in', 'X'), ('use', 'NOUN'), ('ore', 'X'), ("''", 'X'), ('ons', 'NOUN'), ('the', 'X'), ('ral', 'ADJ'), ('led', 'VERB'), ('ose', 'NOUN'), ('ept', 'VERB'), ('she', 'X'), ('up', 'ADP'), ('hen', 'X'), ('his', 'DET'), ('ear', 'ADJ'), ('one', 'NUM'), ('mny', 'NOUN'), (',', 'X'), ('to', 'X'), ('are', 'VERB'), ('ven', 'ADV'), ('uth', 'NOUN'), ('it', 'X'), ('ken', 'ADJ'), ('ked', 'X'), ('as', 'ADP'), ('ure', 'NOUN'), ('tes', 'NOUN'), ('uns', 'NOUN'), ('do', 'VERB'), ('ist', 'NOUN'), ('of', 'X'), ('out', 'ADV'), ('oor', 'NOUN'), ('and', 'CONJ'), ('ant', 'ADJ'), ('rst', 'ADJ'), ('ran', 'VERB'), ('So', 'ADV'), ('.', 'X'), ('til', 'ADP'), ('lid', 'ADJ'), ('olt', 'NOUN'), ('ndy', 'NOUN'), ('ted', 'VERB'), ('a', 'DET'), ('ark', 'NOUN'), ('ere', 'X'), ('was', 'X'), ('ley', 'NOUN'), ('ood', 'ADJ'), ('ing', 'X'), ('ile', 'X'), ('nel', 'NOUN'), ('her', 'PRON'), ('rom', 'ADP'), ('but', 'CONJ'), ('I', 'PRON'), ('elf', 'PRON'), ('fer', 'NOUN'), ('no', 'DET'), ('rve', 'VERB'), ('bad', 'ADJ'), ('ive', 'NUM'), ('cks', 'NOUN'), ('ean', 'VERB'), ('nce', 'NOUN'), ('``', '.'), ('ver', 'ADV')]

4. [@4] <<lda>> Continuing with the Bayesian theme of problem [[bayesian]],
   let's try some [[http://scikit-learn.org/stable/modules/generated/sklearn.discriminant_analysis.LinearDiscriminantAnalysis.html#sklearn.discriminant_analysis.LinearDiscriminantAnalysis][linear discriminant analysis]] with the algorithm found in
   *scikit-learn*, using the tags as the labels we want to learn.  Again, the
   question we're asking is how well do the three-letter suffixes predict
   the tags, so this is a multiclass LDA problem; the example on the man
   page shows a two-class problem.  We'll use the default =svd= method with
   no shrinkage, both because it's a good place to start and because it may
   be able to cope with the size of our tag and feature sets.  Return the
   output of the decision_function and score functions after training and
   testing the classifier.  Compute the LDA with and without downcasing and
   compare and discuss the results.

   


# rewrite to clarify:
#
# two draws w/o replacement of anchors and successors; compare
# permute
# re-draw same anchors with new successors, and then compare all four



5. [@5] <<bow>> One feature that might be helpful in distinguishing
   machine-generated texts is repetition from sentence to sentence.  Let's
   explore that hypothesis informally.  One way we can approach that
   problem by comparing significant words (that is, non-stop words) between
   each sentence and its successor sentence in a corpus.  We'll use the
   Brown corpus, category news, for this problem.  Go ahead and downcase
   unless you want to explain why you don't think it's a good idea.

    For 700 randomly selected sentences in the Brown news corpus (the
   ``first anchor sentences''), and their immediately succeeding sentences
   (''first set of successors''), form bags of the significant words for
   each pair of sentences (so really, these are paired data) and then
   compute the intersection between each pair of bags (so, 700 intersecting
   bags of words).  This is the baseline comparison.

   Tabulate these and compare the results to another randomly drawn 700
   sentences (''second anchor sentences''), ensuring that there are no
   duplicates between the first anchor sentences and the second anchor
   sentences and their successors (sampling without replacement).  Permute
   all sentences in the corpus, then draw the same second anchor sentences
   and their new successors and repeat computing the intersecting bags of
   significant words.   So you'll have three intersecting bags of
   significant words:
      + first anchor and their successors (overall baseline)
      + second anchor and their successors, ensuring that intersection of
        first and second anchors is empty (control for second anchors BOWs)
      + second anchor and new successors after permutation (the experiment).


   Compare and discuss the results.  You may use methods from NLTK,
   scikit-learn, or both for this problem: just be sure your code block is
   complete and self-contained.


6.  [@6] <<ml>> Choose 500 random sentences from the Brown news corpus
   tagged with the universal tagset.  For each sentence, identify the nouns
   and then compile a list of the three tags immediately preceeding each
   noun (excluding chunks smaller than three).  Then encode each chunk in
   the list as a ternary tuple, mapping the tags to integers, and save the
   list of mapped tuples to disk using either pickle or json, as you wish.
   Go ahead and downcase unless you want to explain why you don't think
   it's a good idea.


    Now cluster your saved encodings using the [[http://scikit-learn.org/stable/modules/generated/sklearn.cluster.MeanShift.html#sklearn.cluster.MeanShift][MeanShift]] and
    [[http://scikit-learn.org/stable/modules/generated/sklearn.cluster.AgglomerativeClustering.html#sklearn.cluster.AgglomerativeClustering][AgglomerativeClustering]] algorithms from scikit-learn. For MeanShift,
    take all the defaults; you may run it in parallel if you like and can.
    Run AgglomerativeClustering thrice: first using "ward" for the linkage
    (it will only use a Euclidean metric); and then "average" for the
    linkage and "manhattan" and "cosine" for the metric.  Discuss the
    differences you find in the results of the different trials, using any
    plots you find helpful.

    




* DONE Grading Scale

This homework is worth 15 points. The grading scale is:


| fraction correctly reviewed and answered | points awarded |
|------------------------------------------+----------------|
| \(\ge 0.95\)                             |             15 |
| 0.90 -- 0.94                             |             14 |
| 0.85 -- 0.89                             |             13 |
| 0.80 -- 0.94                             |             12 |
| 0.75 -- 0.79                             |             11 |
| 0.70 -- 0.74                             |             10 |
| 0.65 -- 0.69                             |              9 |
| 0.60 -- 0.64                             |              8 |
| 0.55 -- 0.59                             |              7 |
| 0.50 -- 0.54                             |              6 |
| 0.45 -- 0.49                             |              5 |
| 0.40 -- 0.44                             |              4 |
| 0.35 -- 0.39                             |              3 |
| 0.30 -- 0.34                             |              2 |
| 0.25 -- 0.29                             |              1 |
| \(< 0.25\)                               |              0 |








* DONE Scoring


|     question | max pts | answer ok? |
|--------------+---------+------------|
|            1 |       1 |            |
|            2 |       1 |            |
|            3 |       2 |            |
|            4 |       2 |            |
|            5 |       2 |            |
|            6 |       7 |            |
|--------------+---------+------------|
|  total score |      15 |            |
|   percentage |         |            |
| total points |         |            |
#+TBLFM: @8$2=vsum(@I..@II)::@8$3=vsum(@I..@II)::@9$3=@-1/@-2$-1



